'''
Light:

1. Выберете дз, к функциям которого будете писать тесты (например, вебинар 5);

2. Создайте дополнительную ветку в репозитории GitHub с тестами;

3. Напишите не менее 5ти тестов к функциям выбранного урока;

4. В качестве ответа на дз пришлите ссылку на ветку с тестами или ссылку на PullRequest ветки с тестами с веткой master.

'''


'''
Pro:

light + 

5. Придумайте 2 теста к грязной функции. Примером грязной функции является функция F из задания 4;

Пришлите ответ по инструкции 4.

 
'''
